Duet3D/CoreN2G/src/RP2040/CanFD2040.cpp
/*
 * CanFD2040.cpp
 *
 *  Created on: 22 Aug 2022
 *      Author: David
 */

#include "CanFD2040.h"

#define PICO_MUTEX_ENABLE_SDK120_COMPATIBILITY	0	// used by mutex.h which is included by multicore.h
#include "hardware/regs/dreq.h" // DREQ_PIO0_RX1
#include "hardware/structs/dma.h" // dma_hw
#include "hardware/structs/iobank0.h" // iobank0_hw
#include "hardware/structs/padsbank0.h" // padsbank0_hw
#include "hardware/structs/resets.h" // RESETS_RESET_PIO0_BITS
#include <pico/multicore.h>
#include <RP2040.h>

#include <cstring>

extern "C" void debugPrintf(const char *fmt, ...) noexcept;

extern "C" void PIO_isr() noexcept;

/****************************************************************
 * rp2040 and low-level helper functions
 ****************************************************************/

// Helper compiler definitions
#define barrier() __asm__ __volatile__("": : :"memory")
#define likely(x)       __builtin_expect(!!(x), 1)
#define unlikely(x)     __builtin_expect(!!(x), 0)
#define DIV_ROUND_UP(n,d) (((n) + (d) - 1) / (d))

#pragma GCC optimize ("O3")

// rp2040 helper function to clear a hardware reset bit
static void rp2040_clear_reset(uint32_t reset_bit)
{
    if (resets_hw->reset & reset_bit)
    {
        hw_clear_bits(&resets_hw->reset, reset_bit);
        while (!(resets_hw->reset_done & reset_bit)) { }
    }
}

// Helper to set the mode and extended function of a pin
//TODO use SetPinFunction instead
static void rp2040_gpio_peripheral(uint32_t gpio, int func, int pull_up)
{
    padsbank0_hw->io[gpio] = (
        PADS_BANK0_GPIO0_IE_BITS
        | (PADS_BANK0_GPIO0_DRIVE_VALUE_4MA << PADS_BANK0_GPIO0_DRIVE_MSB)
        | (pull_up > 0 ? PADS_BANK0_GPIO0_PUE_BITS : 0)
        | (pull_up < 0 ? PADS_BANK0_GPIO0_PDE_BITS : 0));
    iobank0_hw->io[gpio].ctrl = func << IO_BANK0_GPIO0_CTRL_FUNCSEL_LSB;
}

/****************************************************************
 * rp2040 PIO support
 ****************************************************************/

#define PIO_CLOCK_PER_BIT 32

#define can2040_offset_sync_found_end_of_message 2u
#define can2040_offset_sync_signal_start 4u
#define can2040_offset_sync_entry 6u
#define can2040_offset_sync_end 13u
#define can2040_offset_shared_rx_read 13u
#define can2040_offset_shared_rx_end 15u
#define can2040_offset_match_load_next 18u
#define can2040_offset_match_end 25u
#define can2040_offset_tx_got_recessive 25u
#define can2040_offset_tx_start 26u
#define can2040_offset_tx_conflict 31u

static const uint16_t can2040_program_instructions[] = {
    0x0085, //  0: jmp    y--, 5
    0x0048, //  1: jmp    x--, 8
    0xe13a, //  2: set    x, 26                  [1]
    0x00cc, //  3: jmp    pin, 12
    0xc000, //  4: irq    nowait 0
    0x00c0, //  5: jmp    pin, 0
    0xc040, //  6: irq    clear 0
    0xe228, //  7: set    x, 8                   [2]
    0xf242, //  8: set    y, 2                   [18]
    0xc104, //  9: irq    nowait 4               [1]
    0x03c5, // 10: jmp    pin, 5                 [3]
    0x0307, // 11: jmp    7                      [3]
    0x0043, // 12: jmp    x--, 3
    0x20c4, // 13: wait   1 irq, 4
    0x4001, // 14: in     pins, 1
    0xa046, // 15: mov    y, isr
    0x00b2, // 16: jmp    x != y, 18
    0xc002, // 17: irq    nowait 2
    0x40eb, // 18: in     osr, 11
    0x4054, // 19: in     y, 20
    0xa047, // 20: mov    y, osr
    0x8080, // 21: pull   noblock
    0xa027, // 22: mov    x, osr
    0x0098, // 23: jmp    y--, 24
    0xa0e2, // 24: mov    osr, y
    0xa242, // 25: nop                           [2]
    0x6021, // 26: out    x, 1
    0xa001, // 27: mov    pins, x
    0x20c4, // 28: wait   1 irq, 4
    0x00d9, // 29: jmp    pin, 25
    0x023a, // 30: jmp    !x, 26                 [2]
    0xc027, // 31: irq    wait 7
};

// 3-bit Gray code table, shifted left 1 bit with lower even parity bit added
constexpr uint8_t GrayTable[] = { 0b0000, 0b0011, 0b0110, 0b0101, 0b1100, 0b1111, 0b1010, 0b1001 };

/****************************************************************
 * CRC calculation
 ****************************************************************/

#if 0

// Calculated 8-bit crc table (see scripts/crc.py)
static constexpr uint16_t crc_table[256] =
{
    0x0000,0x4599,0x4eab,0x0b32,0x58cf,0x1d56,0x1664,0x53fd,0x7407,0x319e,
    0x3aac,0x7f35,0x2cc8,0x6951,0x6263,0x27fa,0x2d97,0x680e,0x633c,0x26a5,
    0x7558,0x30c1,0x3bf3,0x7e6a,0x5990,0x1c09,0x173b,0x52a2,0x015f,0x44c6,
    0x4ff4,0x0a6d,0x5b2e,0x1eb7,0x1585,0x501c,0x03e1,0x4678,0x4d4a,0x08d3,
    0x2f29,0x6ab0,0x6182,0x241b,0x77e6,0x327f,0x394d,0x7cd4,0x76b9,0x3320,
    0x3812,0x7d8b,0x2e76,0x6bef,0x60dd,0x2544,0x02be,0x4727,0x4c15,0x098c,
    0x5a71,0x1fe8,0x14da,0x5143,0x73c5,0x365c,0x3d6e,0x78f7,0x2b0a,0x6e93,
    0x65a1,0x2038,0x07c2,0x425b,0x4969,0x0cf0,0x5f0d,0x1a94,0x11a6,0x543f,
    0x5e52,0x1bcb,0x10f9,0x5560,0x069d,0x4304,0x4836,0x0daf,0x2a55,0x6fcc,
    0x64fe,0x2167,0x729a,0x3703,0x3c31,0x79a8,0x28eb,0x6d72,0x6640,0x23d9,
    0x7024,0x35bd,0x3e8f,0x7b16,0x5cec,0x1975,0x1247,0x57de,0x0423,0x41ba,
    0x4a88,0x0f11,0x057c,0x40e5,0x4bd7,0x0e4e,0x5db3,0x182a,0x1318,0x5681,
    0x717b,0x34e2,0x3fd0,0x7a49,0x29b4,0x6c2d,0x671f,0x2286,0x2213,0x678a,
    0x6cb8,0x2921,0x7adc,0x3f45,0x3477,0x71ee,0x5614,0x138d,0x18bf,0x5d26,
    0x0edb,0x4b42,0x4070,0x05e9,0x0f84,0x4a1d,0x412f,0x04b6,0x574b,0x12d2,
    0x19e0,0x5c79,0x7b83,0x3e1a,0x3528,0x70b1,0x234c,0x66d5,0x6de7,0x287e,
    0x793d,0x3ca4,0x3796,0x720f,0x21f2,0x646b,0x6f59,0x2ac0,0x0d3a,0x48a3,
    0x4391,0x0608,0x55f5,0x106c,0x1b5e,0x5ec7,0x54aa,0x1133,0x1a01,0x5f98,
    0x0c65,0x49fc,0x42ce,0x0757,0x20ad,0x6534,0x6e06,0x2b9f,0x7862,0x3dfb,
    0x36c9,0x7350,0x51d6,0x144f,0x1f7d,0x5ae4,0x0919,0x4c80,0x47b2,0x022b,
    0x25d1,0x6048,0x6b7a,0x2ee3,0x7d1e,0x3887,0x33b5,0x762c,0x7c41,0x39d8,
    0x32ea,0x7773,0x248e,0x6117,0x6a25,0x2fbc,0x0846,0x4ddf,0x46ed,0x0374,
    0x5089,0x1510,0x1e22,0x5bbb,0x0af8,0x4f61,0x4453,0x01ca,0x5237,0x17ae,
    0x1c9c,0x5905,0x7eff,0x3b66,0x3054,0x75cd,0x2630,0x63a9,0x689b,0x2d02,
    0x276f,0x62f6,0x69c4,0x2c5d,0x7fa0,0x3a39,0x310b,0x7492,0x5368,0x16f1,
    0x1dc3,0x585a,0x0ba7,0x4e3e,0x450c,0x0095
};

// Update a crc with 8 bits of data
static uint32_t crc_byte(uint32_t crc, uint32_t data)
{
    return (crc << 8) ^ crc_table[((crc >> 7) ^ data) & 0xff];
}

// Update a crc with 8, 16, 24, or 32 bits of data
static inline uint32_t crc_bytes(uint32_t crc, uint32_t data, uint32_t num)
{
    switch (num) {
    default: crc = crc_byte(crc, data >> 24);
    // no break
    case 3:  crc = crc_byte(crc, data >> 16);
    // no break
    case 2:  crc = crc_byte(crc, data >> 8);
    // no break
    case 1:  crc = crc_byte(crc, data);
    }
    return crc;
}

#endif

// CRC polynomials used, including the MSB
constexpr uint32_t crc17polynomial = 0x0003685B;	// 0b0000'0000'0000'0011'0110'1000'0101'0011 including the leading 1
constexpr uint32_t crc17initialValue = 1u << 31;	// initial value after left shifting
constexpr uint32_t crc21polynomial = 0x00302899; 	// 0b0000'0000'0011'0000'0010'1000'1001'1001;
constexpr uint32_t crc21initialValue = 1u << 31;	// initial value after left shifting

// Calculate CRC17 on a number of bits between 1 and 32 (must not be called with 0 bits!). The bits are right-justified. Any higher bits in the input data are ignored.
uint32_t Crc17(uint32_t remainder, uint32_t data, unsigned int numBits) noexcept
{
	remainder ^= data << (32 - numBits);
	do
	{
		--numBits;
#if 1
		// This code compiles the loop body to 7 instructions including 1 conditional jump
        const uint32_t mask = (remainder & 0x8000'0000) ? 0xFFFFFFFF : 0;
        remainder = (remainder << 1) ^ (mask & (crc17polynomial << (32 - 17)));
#else
		// This code compiles the loop body to 8 instructions including 2 conditional jumps
		if (remainder & 0x8000'0000)
		{
			remainder = (remainder << 1) ^ (crc17polynomial << (32 - 17));
		}
		else
		{
			remainder <<= 1;
		}
#endif
	} while (numBits != 0);
	return remainder;
}

// Calculate CRC17 on a number of bits
uint32_t Crc17(uint32_t initialValue, const uint32_t *buf, unsigned int numBits) noexcept
{
	//TODO
	return initialValue;		//temporary!
}

// Calculate CRC21 on a number of bits between 0 and 32. The bits are right-justified.
// This is very slow and needs to be optimised
uint32_t Crc21(uint32_t remainder, uint32_t data, unsigned int numBits) noexcept
{
	remainder ^= data << (32 - numBits);
	while (numBits != 0)
	{
		--numBits;
		if (remainder & 0x8000'0000)
		{
			remainder = (remainder << 1) ^ (crc21polynomial << (32 - 21));
		}
		else
		{
			remainder <<= 1;
		}
	}
	return remainder;
}

// Calculate CRC21 on a number of bits
uint32_t Crc21(uint32_t initialValue, const uint32_t *buf, unsigned int numBits) noexcept
{
	//TODO
	return initialValue;		//temporary!
}

/****************************************************************
 * Bit unstuffing
 ****************************************************************/

// Update the CRCs with between 1 and 32 bits (0 is not allowed). The data is right-justified and any higher bits in it are ignored.
//TODO do multiples of 8 bits using a lookup table, then any odd bits at the end.
// Possibly save odd bits and combine them with future data.
void BitUnstuffer::AddCrcBits(uint32_t data, unsigned int numBits) noexcept
{
	const uint32_t leftJustifiedData = data << (32 - numBits);
	uint32_t r17 = crc17 ^ leftJustifiedData;
	uint32_t r21 = crc21 ^ leftJustifiedData;
	do
	{
		--numBits;
		// This code compiles the loop body to fewer instructions than using an if-statement does, and saves a conditional jump
        const uint32_t mask17 = (r17 & 0x8000'0000) ? 0xFFFFFFFF : 0;
        r17 = (r17 << 1) ^ (mask17 & (crc17polynomial << (32 - 17)));
        const uint32_t mask21 = (r21 & 0x8000'0000) ? 0xFFFFFFFF : 0;
        r21 = (r21 << 1) ^ (mask21 & (crc21polynomial << (32 - 21)));
	} while (numBits != 0);
	crc17 = r17;
	crc21 = r21;
}

// Initialise the CRCs with 0 to 32 bits of data
inline void BitUnstuffer::InitCrc(uint32_t data, unsigned int numBits) noexcept
{
	crc17 = crc21 = 1u << 31;							// both CRCs start with 1 in the MSB
	if (numBits != 0)
	{
		AddCrcBits(data, numBits);
	}
}

