Duet3D/CoreN2G/src/RP2040/CanFD2040.cpp
// Add 'count' number of bits from 'data' to the unstuffer
// The bits are shifted left into stuffed_bits, and count_stuff is set to the number of bits added
void BitUnstuffer::AddBits(uint32_t data, uint32_t count) noexcept
{
    const uint32_t mask = (1u << count) - 1;
    stuffed_bits = (stuffed_bits << count) | (data & mask);
    stuffedBitsAvailable = count;
}

// Reset state and set the next desired 'count' unstuffed bits to extract
void BitUnstuffer::SetCount(uint32_t count) noexcept
{
    unstuffed_bits = 0;
    unstuffedBitsWanted = count;
}

// Update the stuffed bits history so that it looks like we had just one recessive bit before any remaining unprocessed bits
void BitUnstuffer::ClearState() noexcept
{
	const uint32_t prevBit = 1u << stuffedBitsAvailable;
	stuffed_bits = (stuffed_bits & (prevBit - 1u)) | prevBit;
}

// Pull bits from unstuffer (as specified in unstuf_set_count())
// Return 0 if successful, 1 if need more data, -1 if six recessive bits detected, or -2 if 6 dominant bits detected
int BitUnstuffer::PullBits() noexcept
{
    const uint32_t sb = stuffed_bits;
	uint32_t cs = stuffedBitsAvailable;
	uint32_t cu = unstuffedBitsWanted;

	switch (stuffType)
	{
	case StuffingType::none:		// receiving ACK or EOF, so using no stuff bits
	default:
		{
			const uint32_t toExtract = min<uint32_t>(cu, cs);
			unstuffed_bits = (unstuffed_bits << toExtract)
							| ((stuffed_bits >> (cs - toExtract)) & ((1u << toExtract) - 1u));
			cs -= toExtract;
			cu -= toExtract;
			stuffedBitsAvailable = cs;
			unstuffedBitsWanted = cu;
			return (cu == 0) ? 0 : 1;
		}

	case StuffingType::fixed:		// receiving stuff count or CRC, so using fixed stuff bits
		{
			// When using fixed stuff bits we do not update the CRC
			uint32_t bu = bitsUntilFixedStuffBit;
			while (cu != 0 && cs != 0)
			{
				if (bu == 0)
				{
					// Check that this is the inverse of the previous bit
					if (unlikely(((sb ^ (sb >> 1)) & (1u << (cs - 1))) == 0))
					{
						return ((sb >> cs) & 1u) ? -1 : -2;
					}
					--cs;
					bu = 4;
					if (cs == 0)
					{
						break;
					}
				}
				const uint32_t toExtract = min<uint32_t>(cu, min<uint32_t>(cs, bu));
				unstuffed_bits = (unstuffed_bits << toExtract)
								| ((stuffed_bits >> (cs - toExtract)) & ((1u << toExtract) - 1u));
				cs -= toExtract;
				cu -= toExtract;
				bu -= toExtract;
			}
			stuffedBitsAvailable = cs;
			unstuffedBitsWanted = cu;
			bitsUntilFixedStuffBit = bu;
			return (cu == 0) ? 0 : 1;
		}

	case StuffingType::dynamic:		// receiving header or data, so using variable stuff bits. In CAN-FD the stuff bits are included in the CRC.
		{
			if (cs == 0)
			{
				// Need more data
				return 1;
			}

			const uint32_t edges = sb ^ (sb >> 1);
			const uint32_t e2 = edges | (edges >> 1);
			const uint32_t e4 = e2 | (e2 >> 2);
			const uint32_t rm_bits = ~e4;

			while (true)
			{
				uint32_t try_cnt = cs > cu ? cu : cs;
				for (;;)
				{
					// Try_cnt may be zero here, but we must not call the CRC functions with 0 bits of data
					if (likely(try_cnt != 0))
					{
						const uint32_t try_mask = ((1 << try_cnt) - 1) << (cs + 1 - try_cnt);
						if (likely((rm_bits & try_mask) == 0))
						{
							// No stuff bits in try_cnt bits - copy into unstuffed_bits
							unstuffedBitsWanted = cu = cu - try_cnt;
							stuffedBitsAvailable = cs = cs - try_cnt;
							unstuffed_bits |= ((sb >> cs) & ((1u << try_cnt) - 1)) << cu;
							AddCrcBits(sb >> cs, try_cnt);
							if (cu == 0)
							{
								// Extracted desired bits
								return 0;
							}
							break;
						}
					}

					// There must be at least 1 more bit available
					stuffedBitsAvailable = cs = cs - 1;
					AddCrcBits(sb >> cs, 1);
					if (rm_bits & (1u << (cs + 1)))
					{
						// High bit of try_cnt a stuff bit
						++totalStuffBits;
						if (unlikely(rm_bits & (1u << cs)))
						{
							// Six consecutive bits - a bitstuff error
							return ((sb >> cs) & 1u) ? -1 : -2;
						}
						break;
					}
					// High bit not a stuff bit. Copy 1 bit over, limit try_cnt, and retry
					unstuffedBitsWanted = cu = cu - 1;
					unstuffed_bits |= ((sb >> cs) & 1) << cu;
					try_cnt /= 2;
				}
				if (likely(cs == 0))
				{
					// Need more data
					return 1;
				}
			}
		}
	}
}

/****************************************************************
 * Bit stuffing
 ****************************************************************/

// State storage for building bit stuffed transmit messages
class BitStuffer
{
public:
	BitStuffer(uint32_t *p_buf) noexcept : prev_stuffed(1), bitpos(0), totalStuffBits(0), buf(p_buf) { }
	void pushraw(uint32_t data, uint32_t count) noexcept;
	void push(uint32_t data, uint32_t count) noexcept;
	void AddFixedStuffBit() noexcept;
	uint32_t finalize() noexcept;
	uint32_t stuff(uint32_t& pb, uint32_t num_bits) noexcept;
	uint32_t GetTotalStuffBits() const noexcept { return totalStuffBits; }
	uint32_t GetTotalBits() const noexcept { return bitpos; }

private:
    uint32_t prev_stuffed;		// the previous 5 (or more) bits we have stored in the buffer, so we can tell whether stuffing is needed when we store more bits
    uint32_t bitpos;			// how many bits we have stored in the buffer already
    uint32_t totalStuffBits;
    uint32_t *buf;				// the buffer we are stuffing into
};

// Push 'count' bits of 'data' into stuffer without performing bit stuffing
void BitStuffer::pushraw(uint32_t data, uint32_t count) noexcept
pre(count <= 32)
{
    const uint32_t wp = bitpos / 32;					// current index into the buffer
    const uint32_t bitavail = 32 - (bitpos % 32);		// number of bits available in the word at the current index, 1 to 32
    if (bitavail == 32)
    {
    	buf[wp] = data << (32 - count);
    }
    else if (bitavail >= count)
    {
    	buf[wp] |= data << (bitavail - count);
    }
    else
    {
    	buf[wp] |= data >> (count - bitavail);
    	buf[wp + 1] = data << (32 - (count - bitavail));
    }
    bitpos += count;
}

// Push 'count' (max 26) bits of 'data' into stuffer
void BitStuffer::push(uint32_t data, uint32_t count) noexcept
pre(count <= 26)										// the stuffer may expand 26 bits to 32
{
    data &= (1 << count) - 1;							// clear the high bits
    uint32_t stuf = (prev_stuffed << count) | data;
    const uint32_t newcount = stuff(stuf, count);
    pushraw(stuf, newcount);
    prev_stuffed = stuf;
}

// Pad final word of stuffer with high bits
uint32_t BitStuffer::finalize() noexcept
{
    const uint32_t words = DIV_ROUND_UP(bitpos, 32);
    const uint32_t extra = words * 32 - bitpos;
    if (extra)
    {
        buf[words - 1] |= (1 << extra) - 1;
    }
    return words;
}

