Duet3D/CoreN2G/src/RP2040/CanFD2040.cpp
// Add a fixed stuff bit, not included in the count of total stuff bits
void BitStuffer::AddFixedStuffBit() noexcept
{
	prev_stuffed = (prev_stuffed << 1) | ((prev_stuffed & 1u) ^ 1u);
	pushraw(prev_stuffed & 1u, 1);
}

// Stuff 'num_bits' (max 26) bits in 'pb' - upper bits must already be stuffed. Return the count of bits generated.
uint32_t BitStuffer::stuff(uint32_t& pb, uint32_t num_bits) noexcept
pre(count <= 26)
{
    uint32_t b = pb;
    uint32_t count = num_bits;
    for (;;)
    {
        uint32_t try_cnt = num_bits;
        const uint32_t edges = b ^ (b >> 1);
        const uint32_t e2 = edges | (edges >> 1), e4 = e2 | (e2 >> 2);
        const uint32_t add_bits = ~e4;
        for (;;)
        {
            const uint32_t try_mask = ((1 << try_cnt) - 1) << (num_bits - try_cnt);
            if (!(add_bits & try_mask))
            {
                // No stuff bits needed in try_cnt bits
                if (try_cnt >= num_bits) { goto done; }
                num_bits -= try_cnt;
                try_cnt = (num_bits + 1) / 2;
            }
            else
            {
				if (add_bits & (1 << (num_bits - 1)))
				{
					// A stuff bit must be inserted prior to the high bit
					const uint32_t low_mask = (1 << num_bits) - 1, low = b & low_mask;
					const uint32_t high = (b & ~(low_mask >> 1)) << 1;
					b = high ^ low ^ (1 << (num_bits - 1));
					++count;
					++totalStuffBits;
					if (num_bits <= 4) { goto done; }
					num_bits -= 4;
					break;
				}
				// High bit doesn't need stuff bit - accept it, limit try_cnt, retry
				num_bits--;
				try_cnt /= 2;
            }
        }
    }
done:
    pb = b;
    return count;
}

// CanFD2040 members
// Start CAN-FD running
void CanFD2040::Entry(VirtualCanRegisters *p_regs) noexcept
{
	regs = p_regs;
	numInterrupts = 0;
	IrqEnable();
    for (;;)
    {
    	while (!regs->canEnabled) { }

    	pendingIrqs = 0;
    	txStuffedWords = 0;
    	tx_state = TS_IDLE;
    	pio_setup();										// Set up the PIO and pins
        data_state_go_discard();

    	while (regs->canEnabled)
    	{
    		if (regs->clearErrorCounts)
    		{
    			regs->errors.Clear();
    			regs->clearErrorCounts = false;
    		}
#if 0
    		if (parse_state != MS_DISCARD && parse_state > MS_STUFFCOUNT)
    		{
    			debugPrintf("%" PRIu32 " irqs, state %u\n", numInterrupts, parse_state);
    		}
    		if ((numInterrupts % 997) == 5)
    		{
    			debugPrintf("%" PRIu32 " irqs, state %u\n", numInterrupts, parse_state);
    		}
#endif
    	}

    	// Disable CAN - set output to recessive
    	//TODO
    }
}

// Set up a message ready to be transmitted
void CanFD2040::PopulateTransmitBuffer() noexcept
{
	const volatile CanTxBuffer *const txBuf = &regs->txFifo.buffers[regs->txFifo.getIndex];

	txId = txBuf->T0.bit.ID;
	txDlc = txBuf->T1.bit.DLC;

	// Push the header through the stuffer
	BitStuffer bs(txMessage);
	if (txBuf->T0.bit.XTD)
	{
		// Extended header
		const uint32_t h1 = ((txId & 0x1ffc0000) >> 16) | 0x03;
		const uint32_t h2 = ((txId & 0x3ffff) << 9) | 0x80 | txDlc;
		bs.push(h1, 19);
		bs.push(h2, 20);
	}
	else
	{
		// Standard header
		uint32_t hdr = ((txId & 0x7ff) << 10) | 0x80 | txDlc;
		bs.push(hdr, 21);
	}

	// Push the data
	if (txDlc < 8)
	{
		for (size_t i = 0; i < txDlc; i++)
		{
			bs.push(txBuf->data8[i], 8);
		}
	}
	else
	{
		if (txDlc <= 12)
		{
			for (size_t i = 0; i < 2 * (txDlc - 6); i++)
			{
				bs.push(txBuf->data16[i], 16);
			}
		}
		else
		{
			for (size_t i = 0; i < 8 * (txDlc - 11); i++)
			{
				bs.push(txBuf->data16[i], 16);
			}
		}
	}

	// Push the stuff count
	bs.AddFixedStuffBit();
	bs.push(GrayTable[bs.GetTotalStuffBits() & 7], 4);

	// CRC everything stored so far and store the CRC
	if (txDlc > 10)
	{
		txCrc = Crc21(1u << 20, txMessage, bs.GetTotalBits());
		bs.AddFixedStuffBit();
		bs.pushraw((txCrc >> 17) & 0x0f, 4);
	}
	else
	{
		txCrc = Crc17(1u << 16, txMessage, bs.GetTotalBits());
	}

	bs.AddFixedStuffBit();
	bs.pushraw((txCrc >> 13) & 0x0f, 4);
	bs.AddFixedStuffBit();
	bs.pushraw((txCrc >> 9) & 0x0f, 4);
	bs.AddFixedStuffBit();
	bs.pushraw((txCrc >> 5) & 0x0f, 4);
	bs.AddFixedStuffBit();
	bs.pushraw((txCrc >> 1) & 0x0f, 4);
	bs.AddFixedStuffBit();
	bs.pushraw(txCrc & 0x01, 1);

	txStuffedWords = bs.finalize();
}

void CanFD2040::SendInterrupts() noexcept
{
	if (pendingIrqs != 0 && (sio_hw->fifo_st & SIO_FIFO_ST_RDY_BITS) != 0)
	{
		sio_hw->fifo_wr = pendingIrqs;
		__sev();
		pendingIrqs = 0;
	}
}

// Setup PIO "sync" state machine (state machine 0)
void CanFD2040::pio_sync_setup() noexcept
{
    struct pio_sm_hw *sm = &pio_hw->sm[0];
    sm->execctrl = (
        regs->rxPin << PIO_SM0_EXECCTRL_JMP_PIN_LSB
        | (can2040_offset_sync_end - 1) << PIO_SM0_EXECCTRL_WRAP_TOP_LSB
        | can2040_offset_sync_signal_start << PIO_SM0_EXECCTRL_WRAP_BOTTOM_LSB);
    sm->pinctrl = (
        1 << PIO_SM0_PINCTRL_SET_COUNT_LSB
        | regs->rxPin << PIO_SM0_PINCTRL_SET_BASE_LSB);
    sm->instr = 0xe080; // set pindirs, 0
    sm->pinctrl = 0;
    pio_hw->txf[0] = PIO_CLOCK_PER_BIT / 2 * 8 - 5 - 1;
    sm->instr = 0x80a0; // pull block
    sm->instr = can2040_offset_sync_entry; // jmp sync_entry
}

// Setup PIO "rx" state machine (state machine 1)
void CanFD2040::pio_rx_setup() noexcept
{
    struct pio_sm_hw *sm = &pio_hw->sm[1];
    sm->execctrl = (
        (can2040_offset_shared_rx_end - 1) << PIO_SM0_EXECCTRL_WRAP_TOP_LSB
        | can2040_offset_shared_rx_read << PIO_SM0_EXECCTRL_WRAP_BOTTOM_LSB);
    sm->pinctrl = regs->rxPin << PIO_SM0_PINCTRL_IN_BASE_LSB;
    sm->shiftctrl = 0; // flush fifo on a restart
    sm->shiftctrl = (PIO_SM0_SHIFTCTRL_FJOIN_RX_BITS
                     | 8 << PIO_SM0_SHIFTCTRL_PUSH_THRESH_LSB
                     | PIO_SM0_SHIFTCTRL_AUTOPUSH_BITS);
    sm->instr = can2040_offset_shared_rx_read; // jmp shared_rx_read
}

// Setup PIO "match" state machine (state machine 2)
void CanFD2040::pio_match_setup() noexcept
{
    struct pio_sm_hw *sm = &pio_hw->sm[2];
    sm->execctrl = (
          (can2040_offset_match_end - 1) << PIO_SM0_EXECCTRL_WRAP_TOP_LSB
        | can2040_offset_shared_rx_read << PIO_SM0_EXECCTRL_WRAP_BOTTOM_LSB);
    sm->pinctrl = regs->rxPin << PIO_SM0_PINCTRL_IN_BASE_LSB;
    sm->shiftctrl = 0;
    sm->instr = 0xe040; // set y, 0
    sm->instr = 0xa0e2; // mov osr, y
    sm->instr = 0xa02a, // mov x, !y
    sm->instr = can2040_offset_match_load_next; // jmp match_load_next
}

// Setup PIO "tx" state machine (state machine 3)
void CanFD2040::pio_tx_setup() noexcept
{
    struct pio_sm_hw *sm = &pio_hw->sm[3];
    sm->execctrl = regs->rxPin << PIO_SM0_EXECCTRL_JMP_PIN_LSB;
    sm->shiftctrl = (PIO_SM0_SHIFTCTRL_FJOIN_TX_BITS
                     | PIO_SM0_SHIFTCTRL_AUTOPULL_BITS);
    sm->pinctrl = (1 << PIO_SM0_PINCTRL_SET_COUNT_LSB
                   | 1 << PIO_SM0_PINCTRL_OUT_COUNT_LSB
                   | regs->txPin << PIO_SM0_PINCTRL_SET_BASE_LSB
                   | regs->txPin << PIO_SM0_PINCTRL_OUT_BASE_LSB);
    sm->instr = 0xe001; // set pins, 1
    sm->instr = 0xe081; // set pindirs, 1
}

// Set PIO "sync" machine to signal "may transmit" (sm irq 0) on 11 idle bits
void CanFD2040::pio_sync_normal_start_signal() noexcept
{
    uint32_t eom_idx = can2040_offset_sync_found_end_of_message;
    pio_hw->instr_mem[eom_idx] = 0xe13a; // set x, 26 [1]
}

// Set PIO "sync" machine to signal "may transmit" (sm irq 0) on 17 idle bits
void CanFD2040::pio_sync_slow_start_signal() noexcept
{
    uint32_t eom_idx = can2040_offset_sync_found_end_of_message;
    pio_hw->instr_mem[eom_idx] = 0xa127; // mov x, osr [1]
}

// Test if PIO "rx" state machine has overflowed its fifos
int CanFD2040::pio_rx_check_stall() noexcept
{
    return pio_hw->fdebug & (1 << (PIO_FDEBUG_RXSTALL_LSB + 1));
}

// Report number of bytes still pending in PIO "rx" fifo queue
int CanFD2040::pio_rx_fifo_level() noexcept
{
    return (pio_hw->flevel & PIO_FLEVEL_RX1_BITS) >> PIO_FLEVEL_RX1_LSB;
}

// Set PIO "match" state machine to raise a "matched" signal on a bit sequence
void CanFD2040::pio_match_check(uint32_t match_key) noexcept
{
    pio_hw->txf[2] = match_key;
}

// Calculate pos+bits identifier for PIO "match" state machine
/*static*/ uint32_t CanFD2040::pio_match_calc_key(uint32_t raw_bits, uint32_t rx_bit_pos) noexcept
{
    return (raw_bits & 0x1fffff) | ((-rx_bit_pos) << 21);
}

